Revit 2027 API
CableTraySizeIterator.GetCurrent Method
 Returns the current MEPSize.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSize GetCurrent()
Public Function GetCurrent As MEPSize
public:
MEPSize^ GetCurrent()
member GetCurrent : unit -> MEPSize
Return Value
MEPSize
 The current MEPSize.
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
See Also
Reference
CableTraySizeIterator Class
Autodesk.Revit.DB.Electrical Namespace